<a href="https://colab.research.google.com/github/fiqhrimuliandaputra/DSTraining/blob/main/Jawaban_Tugas_Mingguan_2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Soal 1

In [ ]:
import pandas as pd
import numpy as np
sales_dictionary_2018 = {'name': ['Michael', 'Ana'], 
                     'revenue': ['1000', '2000'], 
                     'number_of_itmes_sold': [5, 7]}
sales_df_2018 = pd.DataFrame(sales_dictionary_2018)
sales_df_2018.head()

      name revenue  number_of_itmes_sold
0  Michael    1000                     5
1      Ana    2000                     7

In [ ]:
sales_dictionary_2019 = {'name': ['Michael', 'Ana', 'George'], 
                     'revenue': ['1000', '3000', '2000'], 
                     'number_of_itmes_sold': [5, 8, 7]}
sales_df_2019 = pd.DataFrame(sales_dictionary_2019)
sales_df_2019.head()

      name revenue  number_of_itmes_sold
0  Michael    1000                     5
1      Ana    3000                     8
2   George    2000                     7

In [ ]:
pd.concat([sales_df_2018, sales_df_2019], ignore_index=True)

      name revenue  number_of_itmes_sold
0  Michael    1000                     5
1      Ana    2000                     7
2  Michael    1000                     5
3      Ana    3000                     8
4   George    2000                     7

In [ ]:
rep_info_dictionary = {'name': ['Ana', 'Michael', 'George'], 
                     'location': ['New York', 'San Jose', 'New York']}
rep_info_df = pd.DataFrame(rep_info_dictionary)
rep_info_df.head()

      name  location
0      Ana  New York
1  Michael  San Jose
2   George  New York

In [ ]:
sales_df_2019.merge(rep_info_df, on='name')

      name revenue  number_of_itmes_sold  location
0  Michael    1000                     5  San Jose
1      Ana    3000                     8  New York
2   George    2000                     7  New York

In [ ]:
sales_df_2019.set_index('name', inplace=True)
sales_df_2019.head()

        revenue  number_of_itmes_sold
name
Michael    1000                     5
Ana        3000                     8
George     2000                     7

In [ ]:
rep_info_df.set_index('name', inplace=True)
rep_info_df.head()

         location
name
Ana      New York
Michael  San Jose
George   New York

In [ ]:
sales_df_2019.join(rep_info_df)

        revenue  number_of_itmes_sold  location
name
Michael    1000                     5  San Jose
Ana        3000                     8  New York
George     2000                     7  New York

# Soal 2

In [ ]:
import pandas as pd
# Buat series of int (s1) dan series of string (s2)
s1 = pd.Series([1,2,3,4,5,6])
s2 = pd.Series(["a","b","c","d","e","f"])
# Terapkan method append
s2_append_s1 = s1.append(s2)
print("Series - append:\n", s2_append_s1)
# Buat dataframe df1 dan df2
df1 = pd.DataFrame({'a':[1,2],
		   'b':[3,4]})
df2 = pd.DataFrame({'b':[1,2],
		   'a':[3,4]})

# Untuk prakteknya terapkanlah method append dengan series s1 dan dataframe df1 ditempatkan setelah series s2 dan dataframe df2 masing-masingnya.

# Terapkan method append
df2_append_df1 = df2.append(df1)
print("Dataframe - append:\n", df2_append_df1)

Series - append:
 0    1
1    2
2    3
3    4
4    5
5    6
0    a
1    b
2    c
3    d
4    e
5    f
dtype: object
Dataframe - append:
    b  a
0  1  3
1  2  4
0  3  1
1  4  2

In [ ]:
import pandas as pd
# Buat dataframe df1 dan df2
df1 = pd.DataFrame({
   'key':['k1','k2','k3','k4','k5'],
   'val1':[200, 500, 0, 500, 100],
   'val2':[30, 50, 100, 20, 10]
})
df2 = pd.DataFrame({
   'key':['k1','k3','k5','k7','k10'],
   'val3':[1,2,3,4,5],
   'val4':[6,7,8,8,10]
})
# Penerapan join dengan menggunakan set_index dan keyword how
join_df = df1.set_index('key').join(df2.set_index('key'), how='inner')
print(join_df)

     val1  val2  val3  val4
key
k1    200    30     1     6
k3      0   100     2     7
k5    100    10     3     8